"""
  day02 复习

    一. python简介
      1. 执行过程: 源代码-编译->字节码-解释->机器码

    二. 数据的基本运算
      1. 变量:
          (1) 语法:  名称 = 数据
          (2) 适用性: 临时存储数据
          (3) 内存:名称就是真是内存地址的别名
                   变量存储数据的地址(可变变化)
      2. del 语句:
          (1) 语法: del 变量
          (2) 作用: 删除变量
          (3) 对象的引用计数:当对象引用计数为0时,对象被销毁.

      3. 数据类型:
          (1) 变量没有类型,指向的对象有类型.
          (2) None:占位;解除绑定.
          (3) 整形int:整数
          (4) 浮点型float:小数
          (5) 字符串str:文本
             a = "1" + 1  错误,文本"1"不能参与数学运算
             b = 1 + 1
          (6) 布尔bool:True 真/对   2  <  5
                     False 假/错   2  >  5
          *(7) 复数complex: 1 + 2j
      4. 转换
          int()  float()  str()  ....
          False: bool("")   bool(0)   bool(0.0)
                 从语义上将,没有数据为False.

      5. 运算符
        算数运算符: +  -  *  **   /  //   %
        增强运算符:+=  -=  *=  **=   /=  //=   %=
        比较运算符:>  <  ==  !=  >=  <=
        逻辑运算符:与    一假俱假    并且
                 或    一真俱真    或者
                 非
                 短路逻辑:一旦有结果,后续逻辑不会判断.
                        建议将复杂的判断放在最后
        身份运算符:is    is not
                 变量1  is  变量2  判断地址
                 id(变量1) == id(变量2)
                 变量1 == 变量2   判断对象

        优先级
          ()
          算数运算符
          比较运算符
          逻辑运算符
          增强运算符
"""
name = None

a = 800
b = a
del a
b = None

print(bool(""))

a = 200
print(a + 5)
print(a)  # 200

a = a + 5
print(a)  # 205
a += 5

# print("我" > 5)


# 短路逻辑
num = 1
#  True  and   ?
# re = num + 1 > 1 and input("请输入") == ""

#  False  and   ?
# re = num + 1 < 1 and input("请输入") == ""

#  True  or   ?
re = num + 1 > 1 or input("请输入") == ""









